# -*- coding: utf-8 -*-
"""
@Time ： 2021/11/16 9:49 下午
@Function ：算术运算
"""

# 取余
yu2 = 9 % 2
print("取余: 9%2=" + str(yu2))

# 除法取整数
z = 7 // 4
print(z)
z2 = 5 // 2
print("取整数位: 5//2=" + str(z2))

# 幂运算（乘方）
z = 3 ** 3
print(z)

z = 2 ** 2
print("2的平方：" + str(z))
z = 2 ** 3
print("2的立方方：" + str(z))

# 幂运算（开方）
z = 27 ** (1 / 3)
print(z)

z = 16 ** (1 / 2)
print("16开平方：" + str(z))
z = 8 ** (1 / 3)
print("9开立方根：" + str(z))

# 精度（所有无限位小数在计算机里面存的都是一个近似值，所以这时候就有一个精确度）
# 双精度（15或16位十进制有效数字）
f = 2 / 3
print("所有无限位小数在计算机里面存的都是一个近似值 2/3="+str(f))

# 四舍五入
print("四舍五入使用round,上面数取两位： "+str(round(f, 2)))

# 取整
ff = int(f * 10 ** 2) / 10 ** 2
print(ff)
print("如果不要，而是直接截取,上面数取两位可这样做 int(f * 10 ** 2) / 10 ** 2： "+str(ff))


"""
优先级：
先算幂，再（* / % //），最后算（+ -）
并列的运算符，从左到右
"""
# 运行原理
# x = 3 + 5 * 4 / 4 - 2
# x = 3 + 5 - 2
x = 3 + 5 * 4 / 2 ** 2 - 2
print(x)

# 多重幂
x = 3 ** 4 ** 2
print(x)
y = (3 ** 4) ** 2
print(y)

# 字符串的加法和乘法
# 字符串的加法：字符拼接
print('ab' + 'bc')
# 字符串的乘法：自身重复拼接
print('ab' * 3)
